openwch/ch32v307/EVT/EXAM/USB/USBHS/DEVICE/SimulateCDC-HID/User/USB_Device/ch32v30x_usbhs_device.c
                                     /* 串口初始化操作 */
                                     UART1_USB_Init( );
                                 }
                                 else if( USBHS_SetupReqCode == HID_SET_REPORT )
                                 {
                                     memcpy(&HID_Report_Buffer[Hid_Report_Ptr],USBHS_EP0_Buf,len);
                                     USBHS_SetupReqLen -= len;
                                     Hid_Report_Ptr += len;
                                     USBHSD->UEP0_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                                     USBHSD->UEP0_RX_CTRL = (USBHSD->UEP0_RX_CTRL & USBHS_UEP_R_TOG_MASK) | USBHS_UEP_R_RES_ACK;
                                 }
                             }
                             else
                             {
                                 /* Standard request end-point 0 Data download */
                             }

                             if( USBHS_SetupReqLen == 0 )
                             {
                                 USBHSD->UEP0_TX_LEN  = 0;
                                 USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                             }
                         }
                            break;

                    /* end-point 2 data out interrupt */
                    case USBHS_UIS_TOKEN_OUT | DEF_UEP2:
                        USBHSD->UEP2_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                        /* Record related information & Switch DMA Address*/
                        Uart.Tx_PackLen[ Uart.Tx_LoadNum ] = USBHSD->RX_LEN;
                        Uart.Tx_LoadNum++;
                        USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&UART1_Tx_Buf[ ( Uart.Tx_LoadNum * DEF_USB_HS_PACK_LEN ) ];
                        if( Uart.Tx_LoadNum >= DEF_UARTx_TX_BUF_NUM_MAX )
                        {
                            Uart.Tx_LoadNum = 0x00;
                            USBHSD->UEP2_RX_DMA = (uint32_t)(uint8_t *)&UART1_Tx_Buf[ 0 ];
                        }
                        Uart.Tx_RemainNum++;

                        /* Determine if the downlink needs to be paused */
                        if( Uart.Tx_RemainNum >= ( DEF_UARTx_TX_BUF_NUM_MAX - 2 ) )
                        {
                            USBHSD->UEP2_RX_CTRL &= ~USBHS_UEP_R_RES_MASK;
                            USBHSD->UEP2_RX_CTRL |= USBHS_UEP_R_RES_NAK;
                            Uart.USB_Down_StopFlag = 0x01;
                        }
                        break;

                    /* end-point 4 data out interrupt */
                    case USBHS_UIS_TOKEN_OUT | DEF_UEP4:
                        USBHSD->UEP4_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                        /* Reverse the data and re-upload */
                        len = USBHSD->RX_LEN;
                        for( i = 0; i < len; i++ )
                        {
                            USBHS_EP4_Tx_Buf[ i ] = ~USBHS_EP4_Rx_Buf[ i ];
                        }
                        USBHSD->UEP4_TX_LEN  = len;
                        USBHSD->UEP4_TX_CTRL &= ~USBHS_UEP_R_RES_MASK;
                        USBHSD->UEP4_TX_CTRL |= USBHS_UEP_R_RES_ACK;
                        break;

                    default:
                        errflag = 0xFF;
                        break;
                }
                break;

            /* Sof pack processing */
            case USBHS_UIS_TOKEN_SOF:
                break;

            default :
                break;
        }
        USBHSD->INT_FG = USBHS_UIF_TRANSFER;
    }
    else if( intflag & USBHS_UIF_SETUP_ACT )
    {
        USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_NAK;
        USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_NAK;

        /* Store All Setup Values */
        USBHS_SetupReqType  = pUSBHS_SetupReqPak->bRequestType;
        USBHS_SetupReqCode  = pUSBHS_SetupReqPak->bRequest;
        USBHS_SetupReqLen   = pUSBHS_SetupReqPak->wLength;
        USBHS_SetupReqValue = pUSBHS_SetupReqPak->wValue;
        USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;

        len = 0;
        errflag = 0;
        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
        {
            /* usb non-standard request processing */
            if( USBHS_SetupReqType & USB_REQ_TYP_CLASS )
            {
                /* Class requests */
                switch( USBHS_SetupReqCode )
                {
                    case CDC_GET_LINE_CODING:
                        pUSBHS_Descr = (uint8_t *)&Uart.Com_Cfg[ 0 ];
                        len = 7;
                        break;

                    case CDC_SET_LINE_CODING:
                        break;

                    case CDC_SET_LINE_CTLSTE:
                        break;

                    case CDC_SEND_BREAK:
                        break;

                    case HID_SET_REPORT:                            /* 0x09: SET_REPORT */
                        Hid_Report_Ptr = 0;
                        break;

                    case HID_GET_REPORT:                            /* 0x01: GET_REPORT */
                        if( USBHS_SetupReqIndex == 0x00 )
                        {
                            Hid_Report_Ptr = 0;
                            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                            memcpy( USBHS_EP0_Buf, &HID_Report_Buffer[Hid_Report_Ptr], len );
                            Hid_Report_Ptr += len;
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                        break;

                    case HID_SET_IDLE:                              /* 0x0A: SET_IDLE */
                        if( USBHS_SetupReqIndex == 0x00 )
                        {
                            USBHS_HidIdle = (uint8_t)( USBHS_SetupReqValue >> 8 );
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                        break;

                    case HID_SET_PROTOCOL:                          /* 0x0B: SET_PROTOCOL */
                        if( USBHS_SetupReqIndex == 0x00 )
                        {
                            USBHS_HidProtocol = (uint8_t)USBHS_SetupReqValue;
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                        break;

