openwch/ch32v307/EVT/EXAM/USB/USBHS/DEVICE/SimulateCDC-HID/User/USB_Device/ch32v30x_usbhs_device.c
                    case HID_GET_IDLE:                              /* 0x02: GET_IDLE */
                        if( USBHS_SetupReqIndex == 0x00 )
                        {
                            USBHS_EP0_Buf[ 0 ] = USBHS_HidIdle;
                            len = 1;
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                        break;

                    case HID_GET_PROTOCOL:                          /* 0x03: GET_PROTOCOL */
                        if( USBHS_SetupReqIndex == 0x00 )
                        {
                            USBHS_EP0_Buf[ 0 ] = USBHS_HidProtocol;
                            len = 1;
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                        break;

                    default:
                        errflag = 0xff;
                        break;
                }
            }
            else if( USBHS_SetupReqType & USB_REQ_TYP_VENDOR )
            {
                /* Manufacturer request */
            }
            else
            {
                errflag = 0xFF;
            }

            /* Copy Descriptors to Endp0 DMA buffer */
            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
            memcpy( USBHS_EP0_Buf, pUSBHS_Descr, len );
            pUSBHS_Descr += len;
        }
        else
        {
            /* usb standard request processing */
            switch( USBHS_SetupReqCode )
            {
                /* get device/configuration/string/report/... descriptors */
                case USB_GET_DESCRIPTOR:
                    switch( (uint8_t)(USBHS_SetupReqValue>>8) )
                    {
                        /* get usb device descriptor */
                        case USB_DESCR_TYP_DEVICE:
                            pUSBHS_Descr = MyDevDescr;
                            len = DEF_USBD_DEVICE_DESC_LEN;
                            break;

                        /* get usb configuration descriptor */
                        case USB_DESCR_TYP_CONFIG:
                            /* Query current usb speed */
                            if( ( USBHSD->SPEED_TYPE & USBHS_SPEED_TYPE_MASK ) == USBHS_SPEED_HIGH )
                            {
                                /* High speed mode */
                                USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                            }
                            else
                            {
                                /* Full speed mode */
                                USBHS_DevSpeed = USBHS_SPEED_FULL;
                                USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                            }

                            /* Load usb configuration descriptor by speed */
                            if( USBHS_DevSpeed == USBHS_SPEED_HIGH )
                            {
                                /* High speed mode */
                                pUSBHS_Descr = MyCfgDescr_HS;
                                len = DEF_USBD_CONFIG_HS_DESC_LEN;
                            }
                            else
                            {
                                /* Full speed mode */
                                pUSBHS_Descr = MyCfgDescr_FS;
                                len = DEF_USBD_CONFIG_FS_DESC_LEN;
                            }
                            break;

                        /* get hid report descriptor */
                        case USB_DESCR_TYP_REPORT:
                            if( USBHS_DevSpeed == USBHS_SPEED_HIGH )
                            {
                                pUSBHS_Descr = MyHIDReportDesc_HS;
                                len = DEF_USBD_REPORT_DESC_LEN;
                            }
                            else
                            {
                                pUSBHS_Descr = MyHIDReportDesc_FS;
                                len = DEF_USBD_REPORT_DESC_LEN;
                            }
                            break;

                        /* get hid descriptor */
                        case USB_DESCR_TYP_HID:
                            if( USBHS_SetupReqIndex == 0x00 )
                            {
                                if( USBHS_DevSpeed == USBHS_SPEED_HIGH )
                                {
                                    pUSBHS_Descr = &MyCfgDescr_HS[ 18 ];
                                    len = 9;
                                }
                                else
                                {
                                    pUSBHS_Descr = &MyCfgDescr_FS[ 18 ];
                                    len = 9;
                                }
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
                            break;

                        /* get usb string descriptor */
                        case USB_DESCR_TYP_STRING:
                            switch( (uint8_t)(USBHS_SetupReqValue&0xFF) )
                            {
                                /* Descriptor 0, Language descriptor */
                                case DEF_STRING_DESC_LANG:
                                    pUSBHS_Descr = MyLangDescr;
                                    len = DEF_USBD_LANG_DESC_LEN;
                                    break;

                                /* Descriptor 1, Manufacturers String descriptor */
                                case DEF_STRING_DESC_MANU:
                                    pUSBHS_Descr = MyManuInfo;
                                    len = DEF_USBD_MANU_DESC_LEN;
                                    break;

                                /* Descriptor 2, Product String descriptor */
                                case DEF_STRING_DESC_PROD:
                                    pUSBHS_Descr = MyProdInfo;
                                    len = DEF_USBD_PROD_DESC_LEN;
                                    break;

